# YOLOv12m + SFE (Shape-aware Feature Extraction)
# ================================================
# 基于 YOLOv12m 架构，在 backbone 早期阶段替换 C3k2 为 SFEBlock，
# 增强对细长缺陷 (scratch) 的方向性特征提取。
#
# 变更点 (相对于标准 yolo12m):
#   - backbone layer 2: C3k2 → SFEBlock (含 LODConv 方向卷积)
#   - backbone layer 4: C3k2 → SFEBlock
#   - backbone layer 8: 新增 SA (Scale-Aware Attention)
#   - head: 保持 A2C2f 不变 (已有 attention 机制)
#
# 参考: GSDNet 论文 — SFE 单模块 +3.5% mAP50 (最大增益)

nc: 3  # scratch, spot, critical
scales:
  m: [0.50, 1.00, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, SFEBlock, [256, False]]     # 2 ← 替换 C3k2, SFE 方向特征
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, SFEBlock, [512, False]]     # 4 ← 替换 C3k2, SFE 方向特征
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]      # 6 ← 保持 A2C2f attention
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]     # 8 ← 保持 A2C2f attention

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]]    # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]]    # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]          # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]]    # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]           # cat head P5
  - [-1, 2, C3k2, [1024, True]]         # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]     # Detect(P3, P4, P5)
